export const strings = {
  scenes: {
    main: {
      start: {
        new_user: "به ربات دستیار امیرکبیر خوش اومدی😄👋",
        hi_user: "سلام جناب  {name} ✋\nبه ربات دستیار امیرکبیر خوش اومدی😄👋",
        any_help: "خب چه کمک دیگه ای ازم بر میاد؟😄",
      },
      keyboard: {
        send_question: "ارسال سوالات و نظرات",
        // my_info: "اطلاعات من",
        about_us: "درباره ما",
      },
    },
    sendingMessage: {
      get_message_type: "لطفا نوع پیام ارسالی را وارد کنید.",
      get_message_title: "لطفا متن پیام خود را ارسال کنید.",
      get_poll_options: "گزینه های خود رو هر کدام در یک پیام وارد کنید. برای پایان end بفرستید.",
      get_next_option: "لطفا گزینه بعدی رو ارسال کنید.",
      should_send_one_option: "حداقل باید یک گزینه را وارد کنید.",
      message_sent_successfully:
        "✅ پیام شما با موفقیت ارسال شد و پس از تایید ادمین در کانال قرار خواهد گرفت.",
    },
  },
  invalid_input: "🚫 ورودی معتبر نیست",
  text: "متن",
  poll: "نظرسنجی",
};
